app/controllers/api/tracks_controller.rb

  def index
    @tracks = Track.with_attached_image.with_attached_sound_file.all
      .includes(:comments, :likes, :user, :likers).order('comments.updated_at DESC')
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."user_id" IN ($1, $2, $3)  [["user_id", 2], ["user_id", 3], ["user_id", 1]]
SELECT "users".* FROM "users"

  def show
    @track = Track.with_attached_image.with_attached_sound_file.where(id: params[:id])
      .includes(:comments, :likes, :user, :likers).order('comments.updated_at DESC')[0]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @track = Track.find(params[:id])
    if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1 WHERE "tracks"."id" = $2  [["title", "Dogwoo"], ["id", 8]]

  def create
    @track = current_user.tracks.new(track_params)
    unless @track.image.attached?
      @track.image.attach(io: File.open(Rails.root.join('app', 'assets', 'images', 'blur_cloud.png')), filename: "blur_cloud.png")
    end
    if @track.save
---
INSERT INTO "tracks" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "Dogwood"], ["user_id", 1]]
INSERT INTO "tracks" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "Out of town"], ["user_id", 1]]

  def destroy
    @track = Track.find(params[:id])
    @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]