app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    unless @user.profile_picture.attached?
      @user.profile_picture.attach(io: File.open(Rails.root.join('app', 'assets', 'images', 'empty_profile.png')), filename: "empty_profile.png")
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "age", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @users = User.with_attached_profile_picture.all.includes(:tracks, :likes, :recently_played_tracks)
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."user_id" IN ($1, $2, $3)  [["user_id", 2], ["user_id", 3], ["user_id", 1]]
SELECT "users".* FROM "users"