app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "dAg4OTIq9iIgCbhsGSjspA"], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.with_attached_profile_picture.with_attached_profile_background.where(session_token: session[:session_token]).includes(:tracks, :likes, :recently_played_tracks, :followers, :followed_users,
      :liked_tracks, :liked_comments, :liked_objects).order('tracks.id ASC')[0]