app/models/user.rb

  def self.find_by_credentials(email, password)
    # debugger
    user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jonahlipsky@protonmail.com"], ["LIMIT", 1]]